In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import warnings 
warnings.filterwarnings("ignore")

In [7]:
import pandas as pd

data = {
    'Name': ['Azam', 'Nirale', 'Kamal', 'Faizan', 'Shadab'],
    'Age': [25, None, 44, 23, None],
    'Salary': [50000, 60000, 70000, None, None]  # 
}

In [8]:
df = pd.DataFrame(data)
print("Original DataFrame")
print(df)

Original DataFrame
     Name   Age   Salary
0    Azam  25.0  50000.0
1  Nirale   NaN  60000.0
2   Kamal  44.0  70000.0
3  Faizan  23.0      NaN
4  Shadab   NaN      NaN

In [9]:
print(df.isnull().sum())

Name      0
Age       2
Salary    2
dtype: int64

# Drop

In [12]:
df_drop = df.dropna()
print(df_drop)

    Name   Age   Salary
0   Azam  25.0  50000.0
2  Kamal  44.0  70000.0

# Fill data

In [14]:
df['Age'].fillna(df['Age'].mean(),inplace = True)
df['Salary'].fillna(df['Salary'].mean(),inplace = True)
print(df)

     Name        Age   Salary
0    Azam  25.000000  50000.0
1  Nirale  30.666667  60000.0
2   Kamal  44.000000  70000.0
3  Faizan  23.000000  60000.0
4  Shadab  30.666667  60000.0

# checking null values

In [15]:
print(df.isnull().sum() * 100)

Name      0
Age       0
Salary    0
dtype: int64

In [16]:
from sklearn.preprocessing import LabelEncoder

In [39]:
df = pd.read_csv("multiple_linear_regression_dataset.csv")

In [40]:
df.columns

Index(['age', 'experience', 'income'], dtype='object')

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         20 non-null     int64
 1   experience  20 non-null     int64
 2   income      20 non-null     int64
dtypes: int64(3)
memory usage: 612.0 bytes

In [42]:
df.describe()

             age  experience        income
count  20.000000   20.000000     20.000000
mean   39.650000    6.200000  40735.500000
std    10.027725    4.124382   8439.797625
min    23.000000    1.000000  27840.000000
25%    31.500000    3.750000  35452.500000
50%    40.000000    5.000000  40190.000000
75%    47.000000    9.000000  45390.000000
max    58.000000   17.000000  63600.000000

In [43]:
df.dtypes

age           int64
experience    int64
income        int64
dtype: object

In [59]:
import pandas as pd
from sklearn.preprocessing import StandardScaler, MinMaxScaler
from sklearn.model_selection import train_test_split

In [60]:
new_data = {
    'StudyHours' : [1,2,3,4,5],
    'TestScore':[40,50,60,70,80]
}

In [61]:
df = pd.DataFrame(new_data)

In [68]:
standard_scaler = StandardScaler()

In [69]:
standard_scaled = standard_scaler.fit(df)

In [70]:
standard_scaled = standard_scaler.fit_transform(df)

In [71]:
print("StandardScaler Output:")
print(pd.DataFrame(standard_scaled, columns=['StudyHours', 'TestScore']))

StandardScaler Output:
   StudyHours  TestScore
0   -1.414214  -1.414214
1   -0.707107  -0.707107
2    0.000000   0.000000
3    0.707107   0.707107
4    1.414214   1.414214

In [74]:
minmax_scaler = MinMaxScaler()
minmax_scaled = minmax_scaler.fit_transform(df)

In [75]:
print("MinMax scaled Output")
print(pd.DataFrame(minmax_scaled, columns=['StudyHours', 'TestScore']))

MinMax scaled Output
   StudyHours  TestScore
0        0.00       0.00
1        0.25       0.25
2        0.50       0.50
3        0.75       0.75
4        1.00       1.00

In [79]:
X = df[['StudyHours']]
y = df[['TestScore']]

In [81]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [82]:
print("training Data")
print(X_train)

training Data
   StudyHours
4           5
2           3
0           1
3           4

In [83]:
y_train

   TestScore
4         80
2         60
0         40
3         70

In [85]:
X_test

   StudyHours
1           2